app/controllers/group_members_controller.rb

SELECT "group_members".* FROM "group_members"
---
    def index
        @groupmembers = GroupMember.all