app/controllers/group_member_controller.rb

    def index
        @groupmembers = GroupMember.all
---
SELECT "group_members".* FROM "group_members"