app/controllers/travelgroup_controller.rb

    def index
      @travelgroups = TravelGroup.all
      @travelgroups.map(|group| GroupMember.in_group(group.id).map())
---
SELECT "travel_groups".* FROM "travel_groups"

    def show
      GroupMember.in_group(@travelgroup.group_id).map(|u| u.user)
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."travel_group_id" = ?  [["travel_group_id", 1]]

    def create
      @travelgroup = TravelGroup.new(travel_group_params)

      # create a group member
      @groupMember = GroupMember.create(@travelgroup.travel_groups_id, users_id)
---
INSERT INTO "travel_groups" ("trip_name", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["trip_name", "European Backpacking Trip"], ["start_date", "2018-11-11"], ["end_date", "2018-12-11"], ["created_at", "2018-11-19 21:44:21.210234"], ["updated_at", "2018-11-19 21:44:21.210234"]]

      def set_travel_group
        @travelgroup = TravelGroup.find(params[:id])
---
SELECT  "travel_groups".* FROM "travel_groups" WHERE "travel_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]