app/controllers/travel_groups_controller.rb

    def index
      @travelgroups = TravelGroup.all
---
SELECT "travel_groups".* FROM "travel_groups"

    def members
      @members = GroupMember.where(travel_group_id: @travelgroup.id)
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."travel_group_id" = ?  [["travel_group_id", 1]]

      def set_travel_group
        @travelgroup = TravelGroup.find(params[:id])
---
SELECT  "travel_groups".* FROM "travel_groups" WHERE "travel_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]